TODO:
    1. 3.4, 3.5, 3.6 look back
        2. 4.2 look back

# 1. Object Lessons

* Layout costs for Adding Encapsulation:
    1. `Data members` are directly contained within each class object;
    2. `Function members`:
        * one copy only of each non-inline member function is gernerated;
        * Each inline function has either zero or one definition of itself generated with module in which it is used.
    3. `Virtual function` is the primary layout and access-time overheads:
        1. The virual function mechanism in its support of an efficient run-time binding.
        2. A virtual base class in its support of a single, shared instance of a base class occurring multiple times with an inheritance hierarchy.

## 1.1 The C++ Object Model
1. Non static data members are allocated directly within each class object.
2. Static data members are stored outside the individual class object.
3. Static and nonstatic function members are also hoisted outside the class object.
4. Virtual funtions are supported in two steps:
    1. A table of pointers to virutal functions is generated for each class(virutal table, `vtbl`).
    2. A single pointer to associated virtual table is inserted within each class object(`vptr`).
        * The setting, resetting, and not setting of the vptr is handled automatically through code generated with each class constructor, destructor, and copy assignment operator.

        2. The `shared region` represents the virtual base class subobjects. The location of data within the shared region fluctuates with each derivation. So members within the shared region need to be accessed indirectly. What has varied among implementations is the method of indirect access.
    2. How is the implementation to gain access to the shared region of the class?
        * A pointer to each virtual base class is inserted within each derived class object. Access of the inherited virtual base class members is achieved indirectly through the associated pointer.
    3. There are two primary weaknesses with this implementation model:
        1. An object of the class carries an additional pointer for each virtual base class. Ideally, we want a constant overhead for the class object that is independent of the number of virtual base classes within its inheritance hierarchy.
        2. As the virtual inheritance chain lengthens, the level of indirection increases to that depth. This means that three levels of virtual derivation requires indirection through three virtual base class pointers. Ideally, we want a constant access time regardless of the depth of the virtual derivation.
    4. There are two general solutions to the first problem.
        1. Microsoft's compiler introduced the `virtual base class table`. Each class object with one or more virtual base classes has a pointer to the virtual base class table inserted within it.
        2. Bjarne's solution is to `place not the address but the offset` of the virtual base class within the virtual function table.
            * Obejct layout & vtb laytout
                ```c++
                // object layout
                clang -Xclang -fdump-record-layouts -stdlib=libc++ -std=c++17 -c model.cc

                // vtb layout
                clang -Xclang -fdump-vtable-layouts -stdlib=libc++ -std=c++17 -c model.cc
                ```

                ```c++
                struct Base {
                    virtual ~Base() = defaul`t;

                    virtual void FuncB() {  }

                    int a;
                    int b;
                };

                struct BaseA : virtual public Base {
                    virtual ~BaseA() = default;

                    virtual void FuncB() {  }

                    int a;
                    int b;
                };

                struct BaseB : virtual public Base {
                    virtual ~BaseB() = default;

                    virtual void FuncC() {  }

                    int a;
                    int b;
                };

                struct Derive : public BaseB, public BaseA {
                    void FuncB() override {  }
                    void FuncC() override {  }
                };

                int main() {
                    BaseA a;
                    Derive d;
                    return 0;
                }
                ```
                ```c++
                Vtable for 'Derive' (20 entries).
                 0 | vbase_offset (32)
                 1 | offset_to_top (0)
                 2 | Derive RTTI
                     -- (BaseB, 0) vtable address --
                     -- (Derive, 0) vtable address --
                 3 | Derive::~Derive() [complete]
                 4 | Derive::~Derive() [deleting]
                 5 | void Derive::FuncC()
                 6 | void Derive::FuncB()
                 7 | vbase_offset (16)
                 8 | offset_to_top (-16)
                 9 | Derive RTTI
                     -- (BaseA, 16) vtable address --
                10 | Derive::~Derive() [complete]
                     [this adjustment: -16 non-virtual] method: BaseA::~BaseA()
                11 | Derive::~Derive() [deleting]
                     [this adjustment: -16 non-virtual] method: BaseA::~BaseA()
                12 | void Derive::FuncB()
                     [this adjustment: -16 non-virtual] method: void BaseA::FuncB()
                13 | vcall_offset (-32)
                14 | vcall_offset (-32)
                15 | offset_to_top (-32)
                16 | Derive RTTI
                     -- (Base, 32) vtable address --
                17 | Derive::~Derive() [complete]
                     [this adjustment: 0 non-virtual, -24 vcall offset offset] method: Base::~Base()
                18 | Derive::~Derive() [deleting]
                     [this adjustment: 0 non-virtual, -24 vcall offset offset] method: Base::~Base()
                19 | void Derive::FuncB()
                     [this adjustment: 0 non-virtual, -32 vcall offset offset] method: void Base::FuncB()

                Virtual base offset offsets for 'Derive' (1 entry).
                Base | -24

                Thunks for 'Derive::~Derive()' (2 entries).
                0 | this adjustment: -16 non-virtual
                1 | this adjustment: 0 non-virtual, -24 vcall offset offset

                Thunks for 'void Derive::FuncB()' (2 entries).
                0 | this adjustment: -16 non-virtual
                1 | this adjustment: 0 non-virtual, -32 vcall offset offset

                VTable indices for 'Derive' (4 entries).
                0 | Derive::~Derive() [complete]
                1 | Derive::~Derive() [deleting]
                2 | void Derive::FuncC()
                3 | void Derive::FuncB()
                ```
                ```c++
                *** Dumping AST Record Layout
                         0 | struct Derive
                         0 |   struct BaseB (primary base)
                         0 |     (BaseB vtable pointer)
                         8 |     int a
                        12 |     int b
                        16 |   struct BaseA (base)
                        16 |     (BaseA vtable pointer)
                        24 |     int a
                        28 |     int b
                        32 |   struct Base (virtual base)
                        32 |     (Base vtable pointer)
                        40 |     int a
                        44 |     int b
                           | [sizeof=48, dsize=48, align=8,
                           |  nvsize=32, nvalign=8]
                ```
            * ![cpp-virtual-inheritance.png](../Images/cpp-virtual-inheritance.png)
                * BaseA has its own virtual `FunB`, Derive overrides it and adds it into vtable of both BaseA and BaseB.

    5. In general, the most efficient use of a virtual base class is that of an abstract virtual base class with no associated data members.
    6. Ref:
        1. https://www.nowcoder.com/profile/3669004/note/detail/232803
        2. https://mp.weixin.qq.com/s?__biz=MzkyODE5NjU2Mw==&mid=2247484758&idx=1&sn=4e614430f666f63ab135c13a716d07c1&chksm=c21d37eaf56abefc8d2a1dc3e09a8146d242475cb0900ee5a94ab6a94a991168a887f7351821&scene=178&cur_album_id=1667018561883570181#rd

## 3.5 Object Member Efficiency
